Тест/Тест/src/AccumulationRegisters/ОплатыПоСделкам/ОплатыПоСделкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОплатыПоСделкам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаДоставку</types>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТелефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.Область</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город2</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна2</name>
    <type>
      <types>CatalogRef.Страна</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастноеЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОдост</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Паспорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Прописка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефониДост</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортВыданКем</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортВыданДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлиента</name>
    <type>
      <types>EnumRef.дт_ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОбращения</name>
    <type>
      <types>CatalogRef.ИсточникиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАвтомобилей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлиента</name>
    <type>
      <types>CatalogRef.ВидыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКлиента</name>
    <type>
      <types>CatalogRef.СтатусыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоКонтакта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролерЗвонков</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПоиск</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>23</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целевой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвто</name>
    <type>
      <types>EnumRef.ТипАвтомобиляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаАвто</name>
    <type>
      <types>CatalogRef.МаркиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СфераДеятельности</name>
    <type>
      <types>CatalogRef.СферыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерКомпании</name>
    <type>
      <types>CatalogRef.РазмерыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТехники</name>
    <type>
      <types>CatalogRef.ТипыТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоследнейЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоследнейЗаявки</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоследнейЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПоПарку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочтительныйВидСвязи</name>
    <type>
      <types>CatalogRef.ПредпочтительныеВидыСвязи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеКлиента</name>
    <type>
      <types>EnumRef.СостояниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановкиОтветственного</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаИНН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрИнтервалЗакупа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоКонтактаКонтролера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаКонтролер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВТСпасибо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КовбойМальборо</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлиентДолжностьРуководителя</name>
    <type>
      <types>EnumRef.ДолжностиРуководителяКлиент</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйНомер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерезвонилиПослеДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоКонтактаКуратор</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКлиентаКолЦентр</name>
    <type>
      <types>EnumRef.СтатусыКлиентаКолЦентра</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОбзвонаКолЦентра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСМСРассылки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Машины</name>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.МашиныКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеКонтакты</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительно</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛПР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВТСпасибо</name>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продажа</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоСПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БонусыКлиента</name>
    <attributes>
      <name>Продажа</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бонусы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Списаны</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусовДоСписания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/CommonForms/СегментацияКлиентовПоГородам/Module.bsl
&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Фильтр = 1 Тогда
		ТекстЗапросаСписокСегментацияКлиентовПоГородам();
	ИначеЕсли Фильтр = 2 Тогда
		ТекстЗапросаСегментацияКлиентовПоОбластям();
	КонецЕсли
КонецПроцедуры

Процедура ТекстЗапросаСписокСегментацияКлиентовПоГородам()
	Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажаЗапчастей.Клиент) КАК КоличествоГорячих,
	|	ПродажаЗапчастей.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ГорячиеКлиентыПоГородам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(ПродажаЗапчастей.ЕстьДоставка
	|	И (ПродажаЗапчастей.ДатаПолучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	ИЛИ ПродажаЗапчастей.Самовывоз
	|	И (ПродажаЗапчастей.ДатаОтгрузкиСоСклада МЕЖДУ &ДатаНачала И &ДатаОкончания))
	|	И ПродажаЗапчастей.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ АКБ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаАКБ И &ДатаОкончанияАКБ
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АКБ.Клиент) КАК КоличествоАктивных,
	|	АКБ.Город КАК Город
	|ПОМЕСТИТЬ АктивныеКлиентыПоГородам
	|ИЗ
	|	АКБ КАК АКБ
	|ГДЕ
	|	АКБ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	АКБ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ТЕПЛЫЕ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаТеплые И &ДатаОкончанияТеплые
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЕПЛЫЕ.Клиент) КАК КоличествоТеплых,
	|	ТЕПЛЫЕ.Город КАК Город
	|ПОМЕСТИТЬ ТеплыеКлиентыПоГородам
	|ИЗ
	|	ТЕПЛЫЕ КАК ТЕПЛЫЕ
	|ГДЕ
	|	ТЕПЛЫЕ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ТЕПЛЫЕ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ПОТЕНЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаПотенциальные И &ДатаОкончанияПотенциальные
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПОТЕНЦ.Клиент) КАК КоличествоПотенциальных,
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ КАК Город
	|ПОМЕСТИТЬ ПотенциальныеКлиентыПоГородам
	|ИЗ
	|	ПОТЕНЦ КАК ПОТЕНЦ
	|ГДЕ
	|	ПОТЕНЦ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХолодныеКлиенты.Клиент) КАК КоличествоХолодных,
	|	ХолодныеКлиенты.Город КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиентыПоГородам
	|ИЗ
	|	ХолодныеКлиенты КАК ХолодныеКлиенты
	|ГДЕ
	|	НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|	И ХолодныеКлиенты.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ХолодныеКлиенты.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Клиент КАК Клиент,
	|	Док.ИтогоРекв КАК СуммаПродажи,
	|	ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК СуммаОплаты,
	|	Док.ИтогоРекв - ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК Долг,
	|	Док.ДолгСписан КАК ДолгСписан
	|ПОМЕСТИТЬ ОборотыДенег
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатыПоСделкам.Обороты КАК ОплатыПоСделкамОбороты
	|		ПО ОплатыПоСделкамОбороты.Документ = Док.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыДенег.Клиент КАК Клиент,
	|	СУММА(ОборотыДенег.Долг) КАК Долг
	|ПОМЕСТИТЬ Долги
	|ИЗ
	|	ОборотыДенег КАК ОборотыДенег
	|ГДЕ
	|	ОборотыДенег.Долг > 0
	|	И ОборотыДенег.ДолгСписан = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ОборотыДенег.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Долги.Клиент) КАК КоличествоДолжников,
	|	Долги.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ДолжникиПоГородам
	|ИЗ
	|	Долги КАК Долги
	|СГРУППИРОВАТЬ ПО
	|	Долги.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиенты.Ссылка) КАК КоличествоНеЦелевых,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ НеЦелевыеКлиентыПоГородам
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Целевой
	|СГРУППИРОВАТЬ ПО
	|	Клиенты.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрГород.Наименование КАК Город,
	|	МАКСИМУМ(ГорячиеКлиентыПоГородам.КоличествоГорячих) КАК КоличествоГорячих,
	|	МАКСИМУМ(АктивныеКлиентыПоГородам.КоличествоАктивных) КАК КоличествоАктивных,
	|	МАКСИМУМ(ТеплыеКлиентыПоГородам.КоличествоТеплых) КАК КоличествоТеплых,
	|	МАКСИМУМ(ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных) КАК КоличествоПотенциальных,
	|	МАКСИМУМ(ХолодныеКлиентыПоГородам.КоличествоХолодных) КАК КоличествоХолодных,
	|	МАКСИМУМ(ДолжникиПоГородам.КоличествоДолжников) КАК КоличествоДолжников,
	|	МАКСИМУМ(НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых) КАК КоличествоНеЦелевых,
	|	МАКСИМУМ(СпрГород.Владелец) КАК Область
	|ПОМЕСТИТЬ ВсеГорода
	|ИЗ
	|	Справочник.Город КАК СпрГород
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГорячиеКлиентыПоГородам КАК ГорячиеКлиентыПоГородам
	|		ПО (СпрГород.Наименование = ГорячиеКлиентыПоГородам.Город)
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеКлиентыПоГородам КАК АктивныеКлиентыПоГородам
	|		ПО (АктивныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТеплыеКлиентыПоГородам КАК ТеплыеКлиентыПоГородам
	|		ПО (ТеплыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПотенциальныеКлиентыПоГородам КАК ПотенциальныеКлиентыПоГородам
	|		ПО (ПотенциальныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХолодныеКлиентыПоГородам КАК ХолодныеКлиентыПоГородам
	|		ПО (ХолодныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолжникиПоГородам КАК ДолжникиПоГородам
	|		ПО (ДолжникиПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеЦелевыеКлиентыПоГородам КАК НеЦелевыеКлиентыПоГородам
	|		ПО (НеЦелевыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|ГДЕ
	|	(АктивныеКлиентыПоГородам.КоличествоАктивных <> 0
	|	ИЛИ ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных <> 0
	|	ИЛИ ГорячиеКлиентыПоГородам.КоличествоГорячих <> 0
	|	ИЛИ НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых <> 0
	|	ИЛИ ХолодныеКлиентыПоГородам.КоличествоХолодных <> 0
	|	ИЛИ ТеплыеКлиентыПоГородам.КоличествоТеплых <> 0
	|	ИЛИ ДолжникиПоГородам.КоличествоДолжников <> 0)
	|СГРУППИРОВАТЬ ПО
	|	СпрГород.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеГорода.Город КАК Город,
	|	ВсеГорода.Область КАК Область,
	|	ВсеГорода.КоличествоГорячих КАК КоличествоГорячих,
	|	ВсеГорода.КоличествоАктивных КАК КоличествоАктивных,
	|	ВсеГорода.КоличествоТеплых КАК КоличествоТеплых,
	|	ВсеГорода.КоличествоПотенциальных КАК КоличествоПотенциальных,
	|	ВсеГорода.КоличествоХолодных КАК КоличествоХолодных,
	|	ВсеГорода.КоличествоДолжников КАК КоличествоДолжников,
	|	ВсеГорода.КоличествоНеЦелевых КАК КоличествоНеЦелевых,
	|	ЕСТЬNULL(ВсеГорода.КоличествоГорячих, 0) + ЕСТЬNULL(ВсеГорода.КоличествоАктивных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоТеплых, 0) + ЕСТЬNULL(ВсеГорода.КоличествоПотенциальных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоХолодных, 0) + ЕСТЬNULL(ВсеГорода.КоличествоДолжников, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоНеЦелевых, 0) КАК Итого
	|ИЗ
	|	ВсеГорода КАК ВсеГорода";
	СписокСегментацияКлиентовПоГородам.ПроизвольныйЗапрос = Истина;
	СписокСегментацияКлиентовПоГородам.ТекстЗапроса = Текст;
КонецПроцедуры

Процедура ТекстЗапросаСегментацияКлиентовПоОбластям()
	Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажаЗапчастей.Клиент) КАК КоличествоГорячих,
	|	ПродажаЗапчастей.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ГорячиеКлиентыПоГородам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(ПродажаЗапчастей.ЕстьДоставка
	|	И (ПродажаЗапчастей.ДатаПолучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	ИЛИ ПродажаЗапчастей.Самовывоз
	|	И (ПродажаЗапчастей.ДатаОтгрузкиСоСклада МЕЖДУ &ДатаНачала И &ДатаОкончания))
	|	И ПродажаЗапчастей.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ АКБ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаАКБ И &ДатаОкончанияАКБ
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АКБ.Клиент) КАК КоличествоАктивных,
	|	АКБ.Город КАК Город
	|ПОМЕСТИТЬ АктивныеКлиентыПоГородам
	|ИЗ
	|	АКБ КАК АКБ
	|ГДЕ
	|	АКБ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	АКБ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ТЕПЛЫЕ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаТеплые И &ДатаОкончанияТеплые
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЕПЛЫЕ.Клиент) КАК КоличествоТеплых,
	|	ТЕПЛЫЕ.Город КАК Город
	|ПОМЕСТИТЬ ТеплыеКлиентыПоГородам
	|ИЗ
	|	ТЕПЛЫЕ КАК ТЕПЛЫЕ
	|ГДЕ
	|	ТЕПЛЫЕ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ТЕПЛЫЕ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ПОТЕНЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаПотенциальные И &ДатаОкончанияПотенциальные
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПОТЕНЦ.Клиент) КАК КоличествоПотенциальных,
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ КАК Город
	|ПОМЕСТИТЬ ПотенциальныеКлиентыПоГородам
	|ИЗ
	|	ПОТЕНЦ КАК ПОТЕНЦ
	|ГДЕ
	|	ПОТЕНЦ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХолодныеКлиенты.Клиент) КАК КоличествоХолодных,
	|	ХолодныеКлиенты.Город КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиентыПоГородам
	|ИЗ
	|	ХолодныеКлиенты КАК ХолодныеКлиенты
	|ГДЕ
	|	НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|	И ХолодныеКлиенты.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ХолодныеКлиенты.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Клиент КАК Клиент,
	|	Док.ИтогоРекв КАК СуммаПродажи,
	|	ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК СуммаОплаты,
	|	Док.ИтогоРекв - ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК Долг,
	|	Док.ДолгСписан КАК ДолгСписан
	|ПОМЕСТИТЬ ОборотыДенег
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатыПоСделкам.Обороты КАК ОплатыПоСделкамОбороты
	|		ПО (ОплатыПоСделкамОбороты.Документ = Док.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыДенег.Клиент КАК Клиент,
	|	СУММА(ОборотыДенег.Долг) КАК Долг
	|ПОМЕСТИТЬ Долги
	|ИЗ
	|	ОборотыДенег КАК ОборотыДенег
	|ГДЕ
	|	ОборотыДенег.Долг > 0
	|	И ОборотыДенег.ДолгСписан = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ОборотыДенег.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Долги.Клиент) КАК КоличествоДолжников,
	|	Долги.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ДолжникиПоГородам
	|ИЗ
	|	Долги КАК Долги
	|СГРУППИРОВАТЬ ПО
	|	Долги.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиенты.Ссылка) КАК КоличествоНеЦелевых,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ НеЦелевыеКлиентыПоГородам
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Целевой
	|СГРУППИРОВАТЬ ПО
	|	Клиенты.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрГород.Наименование КАК Город,
	|	МАКСИМУМ(ГорячиеКлиентыПоГородам.КоличествоГорячих) КАК КоличествоГорячих,
	|	МАКСИМУМ(АктивныеКлиентыПоГородам.КоличествоАктивных) КАК КоличествоАктивных,
	|	МАКСИМУМ(ТеплыеКлиентыПоГородам.КоличествоТеплых) КАК КоличествоТеплых,
	|	МАКСИМУМ(ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных) КАК КоличествоПотенциальных,
	|	МАКСИМУМ(ХолодныеКлиентыПоГородам.КоличествоХолодных) КАК КоличествоХолодных,
	|	МАКСИМУМ(ДолжникиПоГородам.КоличествоДолжников) КАК КоличествоДолжников,
	|	МАКСИМУМ(НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых) КАК КоличествоНеЦелевых,
	|	МАКСИМУМ(СпрГород.Владелец) КАК Область
	|ПОМЕСТИТЬ ВсеГорода
	|ИЗ
	|	Справочник.Город КАК СпрГород
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГорячиеКлиентыПоГородам КАК ГорячиеКлиентыПоГородам
	|		ПО СпрГород.Наименование = ГорячиеКлиентыПоГородам.Город
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеКлиентыПоГородам КАК АктивныеКлиентыПоГородам
	|		ПО (АктивныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТеплыеКлиентыПоГородам КАК ТеплыеКлиентыПоГородам
	|		ПО (ТеплыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПотенциальныеКлиентыПоГородам КАК ПотенциальныеКлиентыПоГородам
	|		ПО (ПотенциальныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХолодныеКлиентыПоГородам КАК ХолодныеКлиентыПоГородам
	|		ПО (ХолодныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолжникиПоГородам КАК ДолжникиПоГородам
	|		ПО (ДолжникиПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеЦелевыеКлиентыПоГородам КАК НеЦелевыеКлиентыПоГородам
	|		ПО (НеЦелевыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|ГДЕ
	|	(АктивныеКлиентыПоГородам.КоличествоАктивных <> 0
	|	ИЛИ ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных <> 0
	|	ИЛИ ГорячиеКлиентыПоГородам.КоличествоГорячих <> 0
	|	ИЛИ НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых <> 0
	|	ИЛИ ХолодныеКлиентыПоГородам.КоличествоХолодных <> 0
	|	ИЛИ ТеплыеКлиентыПоГородам.КоличествоТеплых <> 0
	|	ИЛИ ДолжникиПоГородам.КоличествоДолжников <> 0)
	|СГРУППИРОВАТЬ ПО
	|	СпрГород.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеГорода.Город) КАК Город,
	|	ВсеГорода.Область КАК Область,
	|	СУММА(ВсеГорода.КоличествоГорячих) КАК КоличествоГорячих,
	|	СУММА(ВсеГорода.КоличествоАктивных) КАК КоличествоАктивных,
	|	СУММА(ВсеГорода.КоличествоТеплых) КАК КоличествоТеплых,
	|	СУММА(ВсеГорода.КоличествоПотенциальных) КАК КоличествоПотенциальных,
	|	СУММА(ВсеГорода.КоличествоХолодных) КАК КоличествоХолодных,
	|	СУММА(ВсеГорода.КоличествоДолжников) КАК КоличествоДолжников,
	|	СУММА(ВсеГорода.КоличествоНеЦелевых) КАК КоличествоНеЦелевых,
	|	СУММА(ЕСТЬNULL(ВсеГорода.КоличествоГорячих, 0) + ЕСТЬNULL(ВсеГорода.КоличествоАктивных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоТеплых, 0) + ЕСТЬNULL(ВсеГорода.КоличествоПотенциальных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоХолодных, 0) + ЕСТЬNULL(ВсеГорода.КоличествоДолжников, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоНеЦелевых, 0)) КАК Итого
	|ИЗ
	|	ВсеГорода КАК ВсеГорода
	|СГРУППИРОВАТЬ ПО
	|	ВсеГорода.Область";
	СписокСегментацияКлиентовПоГородам.ПроизвольныйЗапрос = Истина;
	СписокСегментацияКлиентовПоГородам.ТекстЗапроса = Текст;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фильтр = 1;
	ЗаполнитьПараметрыСписокСписокСегментацияКлиентовПоГородам();
КонецПроцедуры

Процедура ЗаполнитьПараметрыСписокСписокСегментацияКлиентовПоГородам()
	// Комлев АА 02/11/24 +++
	
	ДатаВПрошлом  = НачалоДня(ТекущаяДата() - (24 * 60 * 60) * 10);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаВПрошлом);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(
		ТекущаяДата()));

	ДатаНачалаАКБ = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 30;
	ДатаОкончанияАКБ = КонецДня(ТекущаяДата());
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаАКБ", ДатаНачалаАКБ);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияАКБ", ДатаОкончанияАКБ);

	ДатаНачалаТеплые = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончанияТеплые = КонецДня(ТекущаяДата()) - (24 * 60 * 60) * 31;
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаТеплые", ДатаНачалаТеплые);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияТеплые", ДатаОкончанияТеплые);

	ДатаНачалаПотенциальные = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончанияПотенциальные = КонецДня(ТекущаяДата());
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаПотенциальные",
		ДатаНачалаПотенциальные);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияПотенциальные",
		ДатаОкончанияПотенциальные);
		// Комлев АА 02/11/24 ---
КонецПроцедуры
